#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```


Warning: Invalid Attribute Combination

  with module.s3.aws_s3_bucket_lifecycle_configuration.main,
  on ../../modules/s3/main.tf line 30, in resource "aws_s3_bucket_lifecycle_configuration" "main":
  30:   rule {

No attribute specified when one (and only one) of [rule[0].prefix.<.filter]
is required

This will be an error in a future version of the provider
Success! The configuration is valid, but there were some validation warnings
as shown above.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.iam.data.aws_iam_policy_document.ssm_passrole_iap: Reading...
module.iam.data.aws_iam_policy_document.ssm_service_iar: Reading...
data.aws_caller_identity.current: Reading...
module.iam.data.aws_iam_policy.AmazonECSTaskExecutionRolePolicy: Reading...
module.ecr.aws_ecr_repository.frontend: Refreshing state... [id=container-test-dev-frontend]
module.iam.data.aws_iam_policy_document.ssm_passrole_iap: Read complete after 0s [id=3354755441]
module.iam.data.aws_iam_policy_document.ssm_service_iar: Read complete after 0s [id=454589364]
module.iam.data.aws_caller_identity.current: Reading...
module.ecr.aws_ecr_repository.backend: Refreshing state... [id=container-test-dev-backend]
module.network.data.aws_availability_zones.current: Reading...
module.network.data.aws_vpc_endpoint_service.ecr_api: Reading...
module.iam.data.aws_iam_policy_document.ecs_task_iap: Reading...
module.iam.data.aws_iam_policy_document.ecs_task_iap: Read complete after 0s [id=1854767645]
module.iam.data.aws_iam_policy.AmazonSSMManagedInstanceCore: Reading...
module.network.data.aws_vpc_endpoint_service.s3: Reading...
module.s3.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=218317313594]
module.iam.data.aws_iam_policy_document.ecs_code_deploy_iar: Reading...
module.iam.data.aws_iam_policy.AmazonECSTaskExecutionRolePolicy: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.iam.data.aws_iam_policy_document.ecs_code_deploy_iar: Read complete after 0s [id=4250039221]
module.network.data.aws_vpc_endpoint_service.ecr_dkr: Reading...
module.bastion.data.aws_region.current: Reading...
module.bastion.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.iam.data.aws_iam_policy.AmazonSSMManagedInstanceCore: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.network.data.aws_vpc_endpoint_service.logs: Reading...
module.ecr.aws_ecr_repository.bastion: Refreshing state... [id=container-test-dev-bastion]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=218317313594]
module.iam.data.aws_iam_policy_document.ecs_task_iar: Reading...
module.iam.data.aws_iam_policy_document.ecs_task_iar: Read complete after 0s [id=1077804475]
module.iam.data.aws_iam_policy_document.ecs_task_execution_iar: Reading...
module.iam.data.aws_iam_policy_document.ecs_task_execution_iar: Read complete after 0s [id=1077804475]
module.iam.data.aws_iam_policy.AWSCodeDeployRoleForECS: Reading...
module.iam.data.aws_iam_policy.AWSCodeDeployRoleForECS: Read complete after 1s [id=arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS]
module.iam.data.aws_iam_policy_document.ecs_task_execution_iap: Reading...
module.iam.data.aws_iam_policy_document.ecs_task_execution_iap: Read complete after 0s [id=1919734123]
module.s3.data.aws_caller_identity.current: Read complete after 1s [id=218317313594]
module.network.data.aws_availability_zones.current: Read complete after 1s [id=ap-northeast-1]
module.network.data.aws_vpc_endpoint_service.s3: Read complete after 1s [id=3691811387]
module.network.data.aws_vpc_endpoint_service.ecr_dkr: Read complete after 1s [id=2678992883]
module.network.data.aws_vpc_endpoint_service.logs: Read complete after 1s [id=3976633944]
module.network.data.aws_vpc_endpoint_service.ecr_api: Read complete after 1s [id=3124162414]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.backend_ecs.aws_cloudwatch_log_group.awslogs_backend will be created
  + resource "aws_cloudwatch_log_group" "awslogs_backend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/awslogs/container-test-dev-backend"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/ecs/awslogs/container-test-dev-backend"
        }
      + tags_all          = {
          + "Name" = "/aws/ecs/awslogs/container-test-dev-backend"
        }
    }

  # module.backend_ecs.aws_cloudwatch_log_group.containerinsights will be created
  + resource "aws_cloudwatch_log_group" "containerinsights" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/containerinsights/container-test-dev-backend/performance"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "Name" = "container-test-dev-backend"
        }
      + tags_all          = {
          + "Name" = "container-test-dev-backend"
        }
    }

  # module.backend_ecs.aws_codedeploy_app.main will be created
  + resource "aws_codedeploy_app" "main" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "container-test-dev-backend-cluster-container-test-dev-backend-bluegreen-service"
      + tags_all            = (known after apply)
    }

  # module.backend_ecs.aws_codedeploy_deployment_group.main will be created
  + resource "aws_codedeploy_deployment_group" "main" {
      + app_name                    = "container-test-dev-backend-cluster-container-test-dev-backend-bluegreen-service"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "container-test-dev-backend-bluegreen-deployment-group"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = (known after apply)
      + tags                        = {
          + "Name" = "container-test-dev-backend"
        }
      + tags_all                    = {
          + "Name" = "container-test-dev-backend"
        }
      + termination_hook_enabled    = false

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout    = "STOP_DEPLOYMENT"
              + wait_time_in_minutes = 60
            }
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 60
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "container-test-dev-backend"
          + service_name = "container-test-dev-backend-service"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = (known after apply)
                }
              + target_group {
                  + name = "container-test-dev-alb-blue-tg"
                }
              + target_group {
                  + name = "container-test-dev-alb-green-tg"
                }
              + test_traffic_route {
                  + listener_arns = (known after apply)
                }
            }
        }
    }

  # module.backend_ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "container-test-dev-backend"
      + tags     = {
          + "Name" = "container-test-dev-backend"
        }
      + tags_all = {
          + "Name" = "container-test-dev-backend"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.backend_ecs.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "container-test-dev-backend-service"
      + platform_version                   = "1.4.0"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "container-test-dev-backend"
        }
      + tags_all                           = {
          + "Name" = "container-test-dev-backend"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "app"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.backend_ecs.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu                    = 256
                  + essential              = true
                  + image                  = "218317313594.dkr.ecr.ap-northeast-1.amazonaws.com/container-test-dev-backend:latest"
                  + linuxParameters        = {
                      + initProcessEnabled = false
                    }
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/awslogs/container-test-dev-backend"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory                 = 512
                  + mountPoints            = []
                  + name                   = "app"
                  + portMappings           = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = true
                  + stopTimeout            = 2
                  + systemControls         = []
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "container-test-dev-backend-taskdef"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "container-test-dev-backend"
        }
      + tags_all                 = {
          + "Name" = "container-test-dev-backend"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + operating_system_family = "LINUX"
        }
    }

  # module.backend_ecs.aws_service_discovery_private_dns_namespace.main will be created
  + resource "aws_service_discovery_private_dns_namespace" "main" {
      + arn         = (known after apply)
      + description = "local"
      + hosted_zone = (known after apply)
      + id          = (known after apply)
      + name        = "local"
      + tags_all    = (known after apply)
      + vpc         = (known after apply)
    }

  # module.backend_ecs.aws_service_discovery_service.main will be created
  + resource "aws_service_discovery_service" "main" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "container-test-dev-backend-service"
      + namespace_id  = (known after apply)
      + tags_all      = (known after apply)
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (known after apply)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 60
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.bastion.aws_cloudwatch_log_group.awslogs_bastion will be created
  + resource "aws_cloudwatch_log_group" "awslogs_bastion" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/awslogs/container-test-dev-bastion/bastion"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/ecs/awslogs/container-test-dev-bastion/bastion"
        }
      + tags_all          = {
          + "Name" = "/aws/ecs/awslogs/container-test-dev-bastion/bastion"
        }
    }

  # module.bastion.aws_cloudwatch_log_group.containerinsights will be created
  + resource "aws_cloudwatch_log_group" "containerinsights" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/containerinsights/container-test-dev-bastion/performance"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "Name" = "container-test-dev-bastion"
        }
      + tags_all          = {
          + "Name" = "container-test-dev-bastion"
        }
    }

  # module.bastion.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "container-test-dev-bastion"
      + tags     = {
          + "Name" = "container-test-dev-bastion"
        }
      + tags_all = {
          + "Name" = "container-test-dev-bastion"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.bastion.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image            = "218317313594.dkr.ecr.ap-northeast-1.amazonaws.com/container-test-dev-bastion:latest"
                  + linuxParameters  = {
                      + initProcessEnabled = true
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/awslogs/container-test-dev-bastion/bastion"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + name             = "bastion"
                  + pseudoTerminal   = true
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "container-test-dev-bastion"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "container-test-dev-bastion"
        }
      + tags_all                 = {
          + "Name" = "container-test-dev-bastion"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecr.aws_ecr_lifecycle_policy.app will be created
  + resource "aws_ecr_lifecycle_policy" "app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "古いイメージの削除"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "container-test-dev-backend"
    }

  # module.ecr.aws_ecr_lifecycle_policy.bastion will be created
  + resource "aws_ecr_lifecycle_policy" "bastion" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "古いイメージの削除"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "container-test-dev-bastion"
    }

  # module.ecr.aws_ecr_lifecycle_policy.frontend will be created
  + resource "aws_ecr_lifecycle_policy" "frontend" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "古いイメージの削除"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "container-test-dev-frontend"
    }

  # module.frontend_ecs.aws_cloudwatch_log_group.awslogs_frontend will be created
  + resource "aws_cloudwatch_log_group" "awslogs_frontend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/awslogs/container-test-dev-frontend"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/ecs/awslogs/container-test-dev-frontend"
        }
      + tags_all          = {
          + "Name" = "/aws/ecs/awslogs/container-test-dev-frontend"
        }
    }

  # module.frontend_ecs.aws_cloudwatch_log_group.containerinsights will be created
  + resource "aws_cloudwatch_log_group" "containerinsights" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/containerinsights/container-test-dev-frontend/performance"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "Name" = "container-test-dev-frontend"
        }
      + tags_all          = {
          + "Name" = "container-test-dev-frontend"
        }
    }

  # module.frontend_ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "container-test-dev-frontend"
      + tags     = {
          + "Name" = "container-test-dev-frontend"
        }
      + tags_all = {
          + "Name" = "container-test-dev-frontend"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.frontend_ecs.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "container-test-dev-frontend-service"
      + platform_version                   = "1.4.0"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "container-test-dev-frontend"
        }
      + tags_all                           = {
          + "Name" = "container-test-dev-frontend"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "frontend"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.frontend_ecs.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "container-test-dev-frontend-taskdef"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "container-test-dev-frontend"
        }
      + tags_all                 = {
          + "Name" = "container-test-dev-frontend"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.iam.aws_iam_policy.ecs_task_execution_iap will be created
  + resource "aws_iam_policy" "ecs_task_execution_iap" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "container-test-dev-ecs-task-execution-iap"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ecr:ap-northeast-1:218317313594:repository:container-test-dev-frontend",
                          + "arn:aws:ecr:ap-northeast-1:218317313594:repository:container-test-dev-bastion",
                          + "arn:aws:ecr:ap-northeast-1:218317313594:repository:container-test-dev-backend",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ecs-task-execution-iap"
        }
      + tags_all         = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ecs-task-execution-iap"
        }
    }

  # module.iam.aws_iam_policy.ecs_task_iap will be created
  + resource "aws_iam_policy" "ecs_task_iap" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "container-test-dev-ecs-task-iap"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::*/*",
                          + "arn:aws:s3:::*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ecs-task-iap"
        }
      + tags_all         = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ecs-task-iap"
        }
    }

  # module.iam.aws_iam_policy.ssm_passrole_iap will be created
  + resource "aws_iam_policy" "ssm_passrole_iap" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "container-test-dev-ssm-passrole-iap"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:PassRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:PassedToService" = "ssm.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ssm:RemoveTagsFromResource",
                          + "ssm:DeleteActivation",
                          + "ssm:CreateActivation",
                          + "ssm:AddTagsToResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ssm-passrole-iap"
        }
      + tags_all         = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ssm-passrole-iap"
        }
    }

  # module.iam.aws_iam_role.bastion_ecs_task_iar will be created
  + resource "aws_iam_role" "bastion_ecs_task_iar" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "container-test-dev-bastion-ecs-task-iar"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-bastion-ecs-task-iar"
        }
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-bastion-ecs-task-iar"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.ecs_code_deploy_iar will be created
  + resource "aws_iam_role" "ecs_code_deploy_iar" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "container-test-dev-ecs-code-deploy-iar"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ecs-code-deploy-iar"
        }
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ecs-code-deploy-iar"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.ecs_task_execution_iar will be created
  + resource "aws_iam_role" "ecs_task_execution_iar" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "container-test-dev-ecs-task-execution-iar"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ecs-task-execution-iar"
        }
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ecs-task-execution-iar"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.ssm_service_iar will be created
  + resource "aws_iam_role" "ssm_service_iar" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ssm.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "container-test-dev-ssm-service-iar"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ssm-service-iar"
        }
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "container-test-dev-ssm-service-iar"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.bastion_ecs_task_iar_ecs_task_iap will be created
  + resource "aws_iam_role_policy_attachment" "bastion_ecs_task_iar_ecs_task_iap" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "container-test-dev-bastion-ecs-task-iar"
    }

  # module.iam.aws_iam_role_policy_attachment.bastion_ecs_task_iar_ssm_passrole_iap will be created
  + resource "aws_iam_role_policy_attachment" "bastion_ecs_task_iar_ssm_passrole_iap" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "container-test-dev-bastion-ecs-task-iar"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_code_deploy_iar_AWSCodeDeployRoleForECS will be created
  + resource "aws_iam_role_policy_attachment" "ecs_code_deploy_iar_AWSCodeDeployRoleForECS" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + role       = "container-test-dev-ecs-code-deploy-iar"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_task_execution_iar_AmazonECSTaskExecutionRolePolicy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_iar_AmazonECSTaskExecutionRolePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "container-test-dev-ecs-task-execution-iar"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_task_execution_iar_ecs_task_execution_iap will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_iar_ecs_task_execution_iap" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "container-test-dev-ecs-task-execution-iar"
    }

  # module.iam.aws_iam_role_policy_attachment.ssm_service_iar_AmazonSSMManagedInstanceCore will be created
  + resource "aws_iam_role_policy_attachment" "ssm_service_iar_AmazonSSMManagedInstanceCore" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "container-test-dev-ssm-service-iar"
    }

  # module.internal_alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "container-test-dev-internal-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "container-test-dev-internal-alb"
        }
      + tags_all                                                     = {
          + "Name" = "container-test-dev-internal-alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "internal-alb"
        }
    }

  # module.internal_alb_listener_blue.aws_lb_listener.main will be created
  + resource "aws_lb_listener" "main" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = 10
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.internal_alb_listener_green.aws_lb_listener.main will be created
  + resource "aws_lb_listener" "main" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 10080
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = 1
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.internal_alb_target_group_blue_80.aws_lb_target_group.main will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = "round_robin"
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "container-test-dev-alb-blue-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 15
          + matcher             = "200"
          + path                = "/healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.internal_alb_target_group_green_10080.aws_lb_target_group.main will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = "round_robin"
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "container-test-dev-alb-green-tg"
      + name_prefix                        = (known after apply)
      + port                               = 10080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 15
          + matcher             = "200"
          + path                = "/healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.network.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "container-test-dev-igw"
        }
      + tags_all = {
          + "Name" = "container-test-dev-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_route.public_igw will be created
  + resource "aws_route" "public_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route_table.private_app will be created
  + resource "aws_route_table" "private_app" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "container-test-dev-private-app"
        }
      + tags_all         = {
          + "Name" = "container-test-dev-private-app"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private_aurora will be created
  + resource "aws_route_table" "private_aurora" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "container-test-dev-private-aurora"
        }
      + tags_all         = {
          + "Name" = "container-test-dev-private-aurora"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private_bastion will be created
  + resource "aws_route_table" "private_bastion" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "container-test-dev-private-bastion"
        }
      + tags_all         = {
          + "Name" = "container-test-dev-private-bastion"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private_endpoint will be created
  + resource "aws_route_table" "private_endpoint" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "container-test-dev-private-vpce"
        }
      + tags_all         = {
          + "Name" = "container-test-dev-private-vpce"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public_alb will be created
  + resource "aws_route_table" "public_alb" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "container-test-dev-public-alb"
        }
      + tags_all         = {
          + "Name" = "container-test-dev-public-alb"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private_app[0] will be created
  + resource "aws_route_table_association" "private_app" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_app[1] will be created
  + resource "aws_route_table_association" "private_app" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_aurora[0] will be created
  + resource "aws_route_table_association" "private_aurora" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_aurora[1] will be created
  + resource "aws_route_table_association" "private_aurora" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_bastion[0] will be created
  + resource "aws_route_table_association" "private_bastion" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_endpoint[0] will be created
  + resource "aws_route_table_association" "private_endpoint" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_endpoint[1] will be created
  + resource "aws_route_table_association" "private_endpoint" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_alb[0] will be created
  + resource "aws_route_table_association" "public_alb" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_alb[1] will be created
  + resource "aws_route_table_association" "public_alb" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_subnet.private_app[0] will be created
  + resource "aws_subnet" "private_app" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.8.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-app-sbn-a"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-app-sbn-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_app[1] will be created
  + resource "aws_subnet" "private_app" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.9.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-app-sbn-c"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-app-sbn-c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_aurora[0] will be created
  + resource "aws_subnet" "private_aurora" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-autora-sbn-a"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-autora-sbn-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_aurora[1] will be created
  + resource "aws_subnet" "private_aurora" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.17.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-autora-sbn-c"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-autora-sbn-c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_bastion[0] will be created
  + resource "aws_subnet" "private_bastion" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.240.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-bastion-sbn-a"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-bastion-sbn-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_endpoint[0] will be created
  + resource "aws_subnet" "private_endpoint" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.248.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-vpce-sbn-a"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-vpce-sbn-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_endpoint[1] will be created
  + resource "aws_subnet" "private_endpoint" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.249.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-vpce-sbn-c"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-vpce-sbn-c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_alb[0] will be created
  + resource "aws_subnet" "public_alb" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pub-alb-sbn-a"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pub-alb-sbn-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_alb[1] will be created
  + resource "aws_subnet" "public_alb" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pub-alb-sbn-c"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pub-alb-sbn-c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_ecr_api will be created
  + resource "aws_vpc_endpoint" "to_ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.api"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-ecr-api"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-ecr-api"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_ecr_dkr will be created
  + resource "aws_vpc_endpoint" "to_ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-ecr-dkr"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-ecr-dkr"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_logs will be created
  + resource "aws_vpc_endpoint" "to_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.logs"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-logs"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-logs"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_s3 will be created
  + resource "aws_vpc_endpoint" "to_s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-s3"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-s3"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_secretsmanager will be created
  + resource "aws_vpc_endpoint" "to_secretsmanager" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.secretsmanager"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-secretsmanager"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-secretsmanager"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_ssm will be created
  + resource "aws_vpc_endpoint" "to_ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ssm"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-ssm"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-ssm"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_ssmmessages will be created
  + resource "aws_vpc_endpoint" "to_ssmmessages" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ssmmessages"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-ssmmessages"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-ssmmessages"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.public_alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "container-test-dev-public-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "container-test-dev-public-alb"
        }
      + tags_all                                                     = {
          + "Name" = "container-test-dev-public-alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "public-alb"
        }
    }

  # module.public_alb_listener.aws_lb_listener.main will be created
  + resource "aws_lb_listener" "main" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = 10
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.public_alb_target_group_80.aws_lb_target_group.main will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = "round_robin"
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "container-test-dev-public-alb-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 15
          + matcher             = "200"
          + path                = "/healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.s3.aws_s3_bucket.alb_access_logs will be created
  + resource "aws_s3_bucket" "alb_access_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "container-test-dev-alb-access-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "container-test-dev-alb-access-logs"
        }
      + tags_all                    = {
          + "Name" = "container-test-dev-alb-access-logs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_lifecycle_configuration.main will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "main" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "alb_access_logs"
          + prefix = (known after apply)
          + status = "Enabled"

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # module.s3.aws_s3_bucket_ownership_controls.main will be created
  + resource "aws_s3_bucket_ownership_controls" "main" {
      + bucket = "container-test-dev-alb-access-logs"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.s3.aws_s3_bucket_policy.alb_access_logs will be created
  + resource "aws_s3_bucket_policy" "alb_access_logs" {
      + bucket = "container-test-dev-alb-access-logs"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::582318560864:root"
                        }
                      + Resource  = "arn:aws:s3:::container-test-dev-alb-access-logs/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.s3.aws_s3_bucket_public_access_block.access_block_against_porta_api_log_s3 will be created
  + resource "aws_s3_bucket_public_access_block" "access_block_against_porta_api_log_s3" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "container-test-dev-alb-access-logs"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3.aws_s3_bucket_server_side_encryption_configuration.main will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3.aws_s3_bucket_versioning.main will be created
  + resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.sg.aws_security_group.container will be created
  + resource "aws_security_group" "container" {
      + arn                    = (known after apply)
      + description            = "Security group for backend app"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-app-container"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-app-container"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-app-container"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.db will be created
  + resource "aws_security_group" "db" {
      + arn                    = (known after apply)
      + description            = "Security Group of database server"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-db"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-db"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-db"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.front_container will be created
  + resource "aws_security_group" "front_container" {
      + arn                    = (known after apply)
      + description            = "Security group for front container app"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-front-container"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-front-container"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-front-container"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.internal_alb will be created
  + resource "aws_security_group" "internal_alb" {
      + arn                    = (known after apply)
      + description            = "Security group for internal load balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-internal-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-internal-alb"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-internal-alb"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.management will be created
  + resource "aws_security_group" "management" {
      + arn                    = (known after apply)
      + description            = "Security Group of management bastion server"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-management"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-management"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-management"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.public_alb will be created
  + resource "aws_security_group" "public_alb" {
      + arn                    = (known after apply)
      + description            = "Security Group of ingress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from VPC"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "container-test-dev-sg-public-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-public-alb"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-public-alb"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.vpce will be created
  + resource "aws_security_group" "vpce" {
      + arn                    = (known after apply)
      + description            = "Security Group of VPC Endpoint"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-vpce"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-vpce"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-vpce"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group_rule.container_from_sg_alb_internal_HTTP will be created
  + resource "aws_security_group_rule" "container_from_sg_alb_internal_HTTP" {
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.db_from_sg_container will be created
  + resource "aws_security_group_rule" "db_from_sg_container" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.db_from_sg_front_container will be created
  + resource "aws_security_group_rule" "db_from_sg_front_container" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.db_from_sg_management will be created
  + resource "aws_security_group_rule" "db_from_sg_management" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.front_container_from_sg_public_alb_HTTP will be created
  + resource "aws_security_group_rule" "front_container_from_sg_public_alb_HTTP" {
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.internal_alb_from_sg_front_container_HTTP will be created
  + resource "aws_security_group_rule" "internal_alb_from_sg_front_container_HTTP" {
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.internal_alb_from_sg_management_10080 will be created
  + resource "aws_security_group_rule" "internal_alb_from_sg_management_10080" {
      + from_port                = 10080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10080
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.internal_alb_from_sg_management_HTTP will be created
  + resource "aws_security_group_rule" "internal_alb_from_sg_management_HTTP" {
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.vpc_endpoint_from_sg_container_HTTPS will be created
  + resource "aws_security_group_rule" "vpc_endpoint_from_sg_container_HTTPS" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.vpc_endpoint_from_sg_front_container_HTTPS will be created
  + resource "aws_security_group_rule" "vpc_endpoint_from_sg_front_container_HTTPS" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.vpc_endpoint_from_sg_management_HTTPS will be created
  + resource "aws_security_group_rule" "vpc_endpoint_from_sg_management_HTTPS" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = false
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "container-test-dev-vpc"
        }
      + tags_all                             = {
          + "Name" = "container-test-dev-vpc"
        }
    }

Plan: 100 to add, 0 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with module.s3.aws_s3_bucket_lifecycle_configuration.main,
  on ../../modules/s3/main.tf line 30, in resource "aws_s3_bucket_lifecycle_configuration" "main":
  30:   rule {

No attribute specified when one (and only one) of [rule[0].prefix.<.filter]
is required

This will be an error in a future version of the provider

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @yusa0730, Action: `pull_request`, Working Directory: `environments/dev`, Workflow: `dev terraform ci`*